Tekla Open API Reference for Tekla Structures 2025
AnalysisDecomposedTemperatureLoad Class
 The AnalysisDecomposedTemperatureLoad class contains information related to decomposed temperature loads.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Analysis.AnalysisObject
 Tekla.Structures.Analysis.AnalysisDecomposedLoad
 Tekla.Structures.Analysis.AnalysisDecomposedTemperatureLoad
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public sealed class AnalysisDecomposedTemperatureLoad : AnalysisDecomposedLoad
Public NotInheritable Class AnalysisDecomposedTemperatureLoad
	Inherits AnalysisDecomposedLoad
The AnalysisDecomposedTemperatureLoad type exposes the following members.
Constructors
Name | Description
AnalysisDecomposedTemperatureLoad
Initializes a new instance of the AnalysisDecomposedTemperatureLoad class
Top
Properties
Name | Description
AnalysisLoadType
 Gets or sets the type of the analysis decomposed load.
 (Inherited from AnalysisDecomposedLoad.)
AnalysisModelName
 Gets or sets the analysis model name.
 (Inherited from AnalysisObject.)
AnalysisObjectType
 Gets or sets the type of the analysis object.
 (Inherited from AnalysisObject.)
AxialTemperatureDifference
 The axial temperature difference of the decomposed temperature load.
FatherObject2ID
 Gets or sets the identifier of the father part.
 (Inherited from AnalysisObject.)
FatherObject2Type
 Gets or sets the type of the father object.
 (Inherited from AnalysisObject.)
FatherObjectID
 Gets or sets the identifier of the father part.
 (Inherited from AnalysisObject.)
FatherObjectType
 Gets or sets the type of the father object.
 (Inherited from AnalysisObject.)
HorizontalTemperatureDifference
 The horizontal temperature difference of the decomposed temperature load.
ID
 Gets or sets the identifier of the analysis object.
 (Inherited from AnalysisObject.)
ModelLoadGroupID
 Gets or sets the identifier of the load group.
 (Inherited from AnalysisDecomposedLoad.)
ModelLoadID
 Gets or sets the identifier of the model load.
 (Inherited from AnalysisDecomposedLoad.)
ObjectAttachedToID
 Gets or sets the identifier of the object the load is attached to.
 (Inherited from AnalysisDecomposedLoad.)
ObjectAttachedToType
 Gets or sets the type of the object the load is attached to.
 (Inherited from AnalysisDecomposedLoad.)
Strain
 The strain of the decomposed temperature load.
VerticalTemperatureDifference
 The vertical temperature difference of the decomposed temperature load.
Top
Methods
Name | Description
Select
 Selects an analysis decomposed temperature load.
 (Overrides AnalysisObject.Select().)
Top
See Also
Reference
Tekla.Structures.Analysis Namespace